<template>
  <cd-doc :content="content"></cd-doc>
</template>

<script>
import CdDocGeneric from '../generic/cd-doc-generic.vue'
import inputype from '../common/inputtype'

export default {
  components: { 'cd-doc': CdDocGeneric },
  name: 'cd-doc-home',
  data (home) {
    return {
      content: [
        {
          id: 'home-1',
          header: 'CDJS',
          description: [
            'CDJS - Common Declarative JavaScript.'
          ],
          info: [
            {
              id: 'home-1-1',
              header: 'Начнём',
              description: [
                'Поведение через определение. За этими простыми словами скрывается не менее простая идея'
              ],
              info: [
                {
                  header: 'Какая?',
                  description: [
                    'Мы будем определять объект, который однажды станет аргументами render-функции.'
                  ]
                }
              ]
            },
            {
              id: 'home-1-2',
              header: 'Определение',
              description: [
                'Для начала давайте остановимся на определении и определениях. Пользователь, как правило, имеет дело или со списками каких-то объектов, или со свойствами конкретного объекта.<br/>',
                'В списках объектов пользователю опять же нужны его свойства (иначе зачем это всё).<br/>',
                'Попробуем разобраться, как же можно определить и описать свойство<br/>'
              ]
            },
            {
              id: 'home-1-3',
              header: 'Свойство',
              description: [
                'Свойство объекта. Поле таблицы. Выели мозг золотые синицы<br/>',
                'Лемма: Если объект имеет какое-то свойство, его можно назвать.<br/>',
                'Назовём свойство, значением которого названа колонка в таблице БД, <code><b>datafield</b></code>, а для человеческого названия свойства заведём свойство <code><b>text</b></code> дескриптора, и через него будем управлять тем, что увидит пользователь в заголовке столбца таблицы или рядом с полем формы<br/>',
                'От типа данных свойства, от его назначения, зависит то, каким будет элемент формы или столбец таблицы и как он будет себя вести<br/>'
              ],
              info: [
                {
                  // header: 'Простой <input>',
                  description: [
                    'Для простого отображения свойства объекта данных достаточно определить объект-дескриптор с двумя свойствами: <code><b>text</b></code> и <code><b>datafield</b></code><br/>'
                  ]
                },
                {
                  header: 'Свойство <code><b>type</b></code> объекта-дескриптора',
                  description: [
                    `Для рендеринга элемента <code><b>input</b></code> будем использовать свойство объекта-дескриптора <b>type</b>, которое принимает одно из следующих значений: [${inputype}]<br/>`,
                    'Если в дескрипторе свойство <code><b>type</b></code> не определено, по умолчанию отрисуется обычный текстовый <code><b>input</b></code><br/>',
                    '...тут будет что-то ещё....'
                  ]
                },
                {
                  header: 'Свойство <code><b>select</b></code> объекта-дескриптора',
                  description: [
                    'Для рендеринга элемента <code><b>select</b></code> будем использовать свойство объекта-дескриптора <b>select</b>.</br>',
                    `<pre>
<code>
datafield: String,
text: String,
select: {
  valuekey: String, // имя свойства, содержащее ключевое значение опций selecta
  labelkey: String, // имя свойства, содержащее значение для заголовка опции
  url: String, // урл, по которому получим опции
  method: String, // метод
  resolveresult: Function, // функция (response) => Array, которая возвращает список опций из ответа axios 
  isdisabled: Function, // функция (payload, option) => Boolean, которая дисаблит option для свойства datafield объекта payload
  params: Function // функция, которая возвращает параметры запроса к url для получения списка опций
}
</code>
</pre>`,
                    'Подробнее об этом можно будет прочесть в разделе про список (но позже)'
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  }
}
</script>

<style>

</style>
