<template>
  <cd-doc :content="content"></cd-doc>
</template>

<script>
import CdDocGeneric from '../generic/cd-doc-generic.vue'
export default {
  components: { 'cd-doc': CdDocGeneric },
  name: 'cd-doc-home',
  data (home) {
    return {
      content: [
        {
          id: 'home-1',
          header: 'CDJS',
          description: [
            'CDJS - Common Declarative JavaScript.'
          ],
          info: [
            {
              id: 'home-1-1',
              header: 'Начнём',
              description: [
                'Поведение через определение. За этими простыми словами скрывается не менее простая идея'
              ],
              info: [
                {
                  header: 'Какая?',
                  description: [
                    'Мы будем определять объект, который однажды станет аргументами render-функции.'
                  ]
                }
              ]
            },
            {
              id: 'home-1-2',
              header: 'Определение',
              description: [
                'Для начала давайте остановимся на определении и определениях. Пользователь, как правило, имеет дело или со списками каких-то объектов, или со свойствами конкретного объекта.<br/>',
                'В списках объектов пользователю опять же нужны его свойства (иначе зачем это всё).<br/>',
                'Попробуем разобраться, как же можно определить и описать свойство<br/>'
              ]
            },
            {
              id: 'home-1-3',
              header: 'Свойство',
              description: [
                'Свойство объекта. Поле таблицы. Выели мозг золотые синицы<br/>',
                'Лемма: Если объект имеет какое-то свойство, его можно назвать.<br/>',
                'Назовём свойство, значением которого названа колонка в таблице БД, datafield, а для человеческого названия свойства заведём свойство text дескриптора, и через него будем управлять тем, что увидит пользователь в заголовке столбца таблицы или рядом с полем формы<br/>',
                'От типа данных свойства, от его назначения, зависит то, каким будет элемент формы или столбец таблицы и как он будет себя вести<br/>'
              ],
              info: [
                {
                  header: 'Простой <input>',
                  description: 'AA'
                }
              ]
            }
          ]
        }
      ]
    }
  }
}
</script>

<style>

</style>
